app/controllers/examples_controller.rb

SELECT * FROM "examples"
---
  def index
    @examples = Example.all

SELECT * FROM "examples" WHERE ("examples"."id" = 1)
---
  def show
    @example = Example.find(params[:id])

INSERT INTO "examples" ("name", "created_at", "updated_at") VALUES('Testing', '2010-12-21 18:22:14', '2010-12-21 18:22:14')
---
  def create
    @example = Example.new(params[:example])

    respond_to do |format|
      if @example.save